artillerytest.yml
config:
  target: 'http://nearby-414751775.us-west-1.elb.amazonaws.com:3004'
  phases:
    - duration: 60
      arrivalRate: 100
  processor: "./randomNum.js"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - function: "generateRandomData"
    - get:
        url: "/api/restaurants/{{ id }}/nearby"